<!--
 * @公司名: 北京雨花石云计算
 * @Description: 
 * @Author: MArio
 * @Date: 2021-11-06 21:39:30
 * @LastEditTime: 2021-11-06 22:02:37
 * @LastEditors: MArio
-->
<template>
  <div id="startPage">
    <div id="mainlogo">
      <svg
        t="1636207044363"
        class="icon"
        viewBox="0 0 1024 1024"
        version="1.1"
        xmlns="http://www.w3.org/2000/svg"
        p-id="5799"
        width="62"
        height="62"
      >
        <path
          d="M187.733333 665.6s0-42.666667 64-42.666667h55.466667c25.6 0 46.933333 17.066667 51.2 42.666667 0 145.066667 136.533333 145.066667 162.133333 140.8 25.6 0 128 0 136.533334-102.4 4.266667-46.933333-42.666667-89.6-93.866667-110.933333h234.666667c42.666667 89.6 38.4 345.6-264.533334 345.6h-4.266666c-354.133333 4.266667-341.333333-273.066667-341.333334-273.066667z m-110.933333-119.466667c-21.333333 0-34.133333-17.066667-34.133333-34.133333s12.8-34.133333 34.133333-34.133333h874.666667c17.066667 0 29.866667 12.8 29.866666 34.133333 0 17.066667-12.8 34.133333-29.866666 34.133333H76.8zM243.2 426.666667s-149.333333-285.866667 213.333333-337.066667c200.533333-25.6 290.133333 46.933333 332.8 123.733333 21.333333 38.4 34.133333 85.333333 34.133334 128 0 0 0 42.666667-51.2 42.666667h-64c-25.6 0-46.933333-17.066667-51.2-42.666667 0 0 8.533333-119.466667-140.8-119.466666S384 315.733333 384 328.533333c0 12.8 12.8 68.266667 128 98.133334H243.2z"
          p-id="5800"
        ></path>
      </svg>
      <div class="StartLogoText"> {{logoText}}</div>
     
    </div>
  </div>
</template>

<script>
export default {
  name: "startPage",
  data(){
      return {
          logoText:"赏图是一种美"
      }
  }
};
</script>

<style>
#startPage {
  width: 100%;
  height: 100%;
  background-color: #f9f9f9;
}
#mainlogo {
  text-align: center; /*让div内部文字居中*/
  /* background-color: #fff; */
  border-radius: 20px;
  width: 130px;
  height: 130px;
  margin: auto;
  position: absolute;
  top: 0;
  left: 0;
  right: 0;
  bottom: 0;
}
.StartLogoText {
    color: #7e758e;
}
</style>
